In [8]:
#  Write only one for a notebook
import sqlite3
conn = sqlite3.connect('test.db')
cur = conn.cursor()


%load_ext sql
%sql sqlite:///test.db
%reload_ext sql

In [11]:
%%sql
drop table if exists building_visits;
CREATE TABLE building_visits(
    visit_date_time DATETIME,
    visitors_name VARCHAR(512),
    visited_floor INT
);


-- Insert values into the table

INSERT INTO building_visits (visit_date_time, visitors_name, visited_floor)
VALUES
('2023-12-28 09:00', 'Arjun Patel', 5),
('2023-12-28 10:30', 'Priya Gupta', 8),
('2023-12-28 11:15', 'Arjun Patel', 10),
('2023-12-28 14:00', 'Ananya Singh', 3),
('2023-12-28 15:45', 'Priya Gupta', 5),
('2023-12-28 16:30', 'Arjun Patel', 5),
('2023-12-28 17:20', 'Ananya Singh', 2),
('2023-12-28 18:10', 'Priya Gupta', 6),
('2023-12-28 18:45', 'Arjun Patel', 1),
('2023-12-28 19:30', 'Ananya Singh', 2);

 * sqlite:///test.db
Done.
Done.
10 rows affected.

[]

In [12]:
%%sql

select * from building_visits ;

 * sqlite:///test.db
Done.

[('2023-12-28 09:00', 'Arjun Patel', 5),
 ('2023-12-28 10:30', 'Priya Gupta', 8),
 ('2023-12-28 11:15', 'Arjun Patel', 10),
 ('2023-12-28 14:00', 'Ananya Singh', 3),
 ('2023-12-28 15:45', 'Priya Gupta', 5),
 ('2023-12-28 16:30', 'Arjun Patel', 5),
 ('2023-12-28 17:20', 'Ananya Singh', 2),
 ('2023-12-28 18:10', 'Priya Gupta', 6),
 ('2023-12-28 18:45', 'Arjun Patel', 1),
 ('2023-12-28 19:30', 'Ananya Singh', 2)]

In [13]:
# Write an SQL query to fetch ğ­ğ¡ğ ğ¯ğ¢ğ¬ğ¢ğ­ğ¨ğ« ğ§ğšğ¦ğğ¬, ğ§ğ¨. ğ¨ğŸ ğ¯ğ¢ğ¬ğ¢ğ­ğ¬ ğ¦ğšğğ & ğ¦ğ¨ğ¬ğ­ ğ¯ğ¢ğ¬ğ¢ğ­ğğ ğŸğ¥ğ¨ğ¨ğ« ğŸğ¨ğ« ğğšğœğ¡ ğ§ğšğ¦ğ.
# ğˆğ§ ğœğšğ¬ğ ğ¨ğŸ ğ­ğ¢ğ ğŸğ¨ğ« ğ¦ğ¨ğ¬ğ­ ğ¯ğ¢ğ¬ğ¢ğ­ğğ ğŸğ¥ğ¨ğ¨ğ« ğœğ¨ğ§ğ¬ğ¢ğğğ« ğšğ¥ğ¥ ğ­ğ¡ğ ğŸğ¥ğ¨ğ¨ğ«ğ¬.
%%sql
WITH cte2 AS(
    WITH cte1 AS (
        SELECT visitors_name, visited_floor, ROW_NUMBER() OVER(PARTITION BY visitors_name, visited_floor) rn
        FROM building_visits )
    SELECT *, COUNT(rn) OVER(PARTITION BY visitors_name) no_of_visits,
    MAX(rn) OVER(PARTITION BY visitors_name) rn1
    FROM cte1)
SELECT visitors_name, no_of_visits, visited_floor most_visited_floor FROM cte2
WHERE rn = rn1 ;

 * sqlite:///test.db
Done.

[('Ananya Singh', 3, 2),
 ('Arjun Patel', 4, 5),
 ('Priya Gupta', 3, 5),
 ('Priya Gupta', 3, 6),
 ('Priya Gupta', 3, 8)]

 **Problem statement 2 : *write* a query to find number of gold medal per swimmer for swimmers who won only gold medals**

In [17]:

%%sql
CREATE TABLE events (
ID int,
event varchar(255),
YEAR INt,
GOLD varchar(255),
SILVER varchar(255),
BRONZE varchar(255)
);

delete from events;

INSERT INTO events VALUES (1,'100m',2016, 'Amthhew Mcgarray','donald','barbara');
INSERT INTO events VALUES (2,'200m',2016, 'Nichole','Alvaro Eaton','janet Smith');
INSERT INTO events VALUES (3,'500m',2016, 'Charles','Nichole','Susana');
INSERT INTO events VALUES (4,'100m',2016, 'Ronald','maria','paula');
INSERT INTO events VALUES (5,'200m',2016, 'Alfred','carol','Steven');
INSERT INTO events VALUES (6,'500m',2016, 'Nichole','Alfred','Brandon');
INSERT INTO events VALUES (7,'100m',2016, 'Charles','Dennis','Susana');
INSERT INTO events VALUES (8,'200m',2016, 'Thomas','Dawn','catherine');
INSERT INTO events VALUES (9,'500m',2016, 'Thomas','Dennis','paula');
INSERT INTO events VALUES (10,'200m',2016, 'jessica','Donald','Stefeney');
INSERT INTO events VALUES (11,'500m',2016,'Thomas','Steven','Catherine');

 * sqlite:///test.db
Done.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [19]:
%%sql
select GOLD as swimmer, count(GOLD) as total_medals from events group by GOLD having GOLD not in
(select SILVER from events
union all
select BRONZE from events) ;

 * sqlite:///test.db
Done.

[('Amthhew Mcgarray', 1),
 ('Charles', 2),
 ('Ronald', 1),
 ('Thomas', 3),
 ('jessica', 1)]

**Problem statement 3**: Write an SQL query ğ­ğ¨ ğğ¢ğ¬ğ©ğ¥ğšğ² ğ­ğ¡ğ ğğğ©ğ­ ğ°ğ¡ğ¢ğœğ¡ ğ¡ğšğ¬ ğ­ğ¡ğ ğ¨ğ¯ğğ«ğšğ¥ğ¥ ğ¦ğ¢ğ§ğ¢ğ¦ğ®ğ¦ ğ­ğ±ğ§ğšğ¦ğ¨ğ®ğ§ğ­ ğšğ§ğ ğ­ğ¡ğ ğğğ©ğ­ ğ°ğ¡ğ¢ğœğ¡ ğ¡ğšğ¬ ğ­ğ¡ğ ğ¨ğ¯ğğ«ğšğ¥ğ¥ ğ¦ğšğ±ğ¢ğ¦ğ®ğ¦ ğ­ğ«ğšğ§ğ¬ğšğœğ­ğ¢ğ¨ğ§ ğšğ¦ğ¨ğ®ğ§ğ­.

In [20]:

%%sql
create table ecommerce(dept varchar(50),txnmonth varchar(50),txnamount int);
insert into ecommerce values('Electronics','Jan',1000);
insert into ecommerce values('Electronics','Feb',2000);
insert into ecommerce values('Electronics','Mar',2500);
insert into ecommerce values('Textile','Jan',1000);
insert into ecommerce values('Textile','Feb',2000);
insert into ecommerce values('Textile','Mar',1500);
insert into ecommerce values('Sports','Jan',600);
insert into ecommerce values('Sports','Feb',200);
insert into ecommerce values('Sports','Mar',500);

 * sqlite:///test.db
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [21]:
%%sql
with cte1 as
(SELECT dept minimum_transaction FROM ecommerce ORDER BY txnamount LIMIT 1),
cte2 as (SELECT dept maximum_transaction FROM ecommerce ORDER BY txnamount DESC LIMIT 1)
SELECT * FROM cte1, cte2;

 * sqlite:///test.db
Done.

[('Sports', 'Electronics')]

**Problem statement 4** : Given the travel table with columns ğ¬ğ¨ğ®ğ«ğœğ, ğğğ¬ğ­ğ¢ğ§ğšğ­ğ¢ğ¨ğ§, ğšğ§ğ ğğ¢ğ¬ğ­ğšğ§ğœğ. Write an SQL query ğ­ğ¨ ğŸğ¢ğ§ğ ğšğ¥ğ¥ ğ®ğ§ğ¢ğªğ®ğ ğ­ğ«ğšğ¯ğğ¥ ğ«ğ¨ğ®ğ­ğğ¬.
ğ‹ğğ­'ğ¬ ğœğ¨ğ§ğ¬ğ¢ğğğ« ğ°ğ ğ¡ğšğ¯ğ ğğšğ­ğš ğ°ğ¡ğğ«ğ ğ­ğ«ğšğ¯ğğ¥ ğ«ğ¨ğ®ğ­ğğ¬ ğğ±ğ¢ğ¬ğ­ ğ›ğğ­ğ°ğğğ§ ğğšğ§ğ ğšğ¥ğ¨ğ«ğ ğ­ğ¨ ğŒğ®ğ¦ğ›ğšğ¢, ğšğ§ğ ğšğ¥ğ¬ğ¨ ğ›ğğ­ğ°ğğğ§ ğŒğ®ğ¦ğ›ğšğ¢ ğ­ğ¨ ğğšğ§ğ ğšğ¥ğ¨ğ«ğ. ğ…ğ¨ğ« ğ¬ğ®ğœğ¡ ğğšğ­ğš, ğ¨ğ§ğ¥ğ² ğ¨ğ§ğ ğ«ğ¨ğ®ğ­ğ ğ¬ğ¡ğ¨ğ®ğ¥ğ ğ›ğ ğœğ¨ğ§ğ¬ğ¢ğğğ«ğğ.

In [22]:
%%sql
CREATE TABLE travel ( source VARCHAR(512),
destination VARCHAR(512),
distance INT
);
INSERT INTO travel VALUES ('Mumbai', 'Bangalore', '500'),
('Bangalore', 'Mumbai', '500'),
('Delhi', 'Mathura', '150'),
('Mathura', 'Delhi', '150'),
('Nagpur', 'Pune', '500'),
('Pune', 'Nagpur', '500');

 * sqlite:///test.db
Done.
6 rows affected.

[]

In [23]:
%%sql
select * from travel where source > destination

 * sqlite:///test.db
Done.

[('Mumbai', 'Bangalore', 500),
 ('Mathura', 'Delhi', 150),
 ('Pune', 'Nagpur', 500)]

***Problem statement 5:*** ğ—ªğ—¿ğ—¶ğ˜ğ—² ğ—®ğ—» ğ—¦ğ—¤ğ—Ÿ ğ—¾ğ˜‚ğ—²ğ—¿ğ˜† ğ˜ğ—¼ ğ˜ğ—¿ğ—®ğ—»ğ˜€ğ—³ğ—¼ğ—¿ğ—º ğ˜ğ—µğ—² ğ—¶ğ—»ğ—½ğ˜‚ğ˜ ğ˜ğ—®ğ—¯ğ—¹ğ—² ğ—¶ğ—»ğ˜ğ—¼ ğ˜ğ—µğ—² ğ—¼ğ˜‚ğ˜ğ—½ğ˜‚ğ˜ ğ˜ğ—®ğ—¯ğ—¹ğ—² ğ—®ğ˜€ ğ˜€ğ—µğ—¼ğ˜„ğ—» ğ—¯ğ—²ğ—¹ğ—¼ğ˜„.

In [25]:
%%sql
CREATE TABLE employees (
emp_id INT,
age INT
);

INSERT INTO employees (emp_id, age) VALUES
(1, 5),
(2, 16),
(3, 19),
(4, 31),
(5, 50);

 * sqlite:///test.db
Done.
5 rows affected.

[]

In [29]:
%%sql
select emp_id, age ,
case
when age between 1 and 10 then '1-10'
when age between 11 and 20 then '11-20'
when age between 21 and 30 then '21-30'
when age between 31 and 40 then '31-40'
when age between 41 and 50 then '41-50'
end as age_group from employees;

 * sqlite:///test.db
Done.

[(1, 5, '1-10'),
 (2, 16, '11-20'),
 (3, 19, '11-20'),
 (4, 31, '31-40'),
 (5, 50, '41-50')]

***Problem statement 6***: Write an SQL query ğ­ğ¨ ğŸğğ­ğœğ¡ ğ­ğ¡ğ ğ®ğ¬ğğ«_ğ¢ğğ¬ ğ°ğ¡ğ¢ğœğ¡ ğ¡ğšğ¯ğ ğ¨ğ§ğ¥ğ² ğ›ğ¨ğ®ğ ğ¡ğ­ 'ğğ®ğ«ğ ğğ«' ğšğ§ğ 'ğ‚ğ¨ğ¥ğ ğƒğ«ğ¢ğ§ğ¤' ğšğ§ğ ğ§ğ¨ ğ¨ğ­ğ¡ğğ« ğ¢ğ­ğğ¦ğ¬.

In [33]:

%%sql
CREATE TABLE orders(
user_id INT,
item_ordered VARCHAR(512)
);
INSERT INTO orders VALUES ('1', 'Pizza');
INSERT INTO orders VALUES ('1', 'Burger');
INSERT INTO orders VALUES ('2', 'Cold Drink');
INSERT INTO orders VALUES ('2', 'Burger');
INSERT INTO orders VALUES ('3', 'Burger');
INSERT INTO orders VALUES ('3', 'Cold Drink');
INSERT INTO orders VALUES ('4', 'Pizza');
INSERT INTO orders VALUES ('4', 'Cold Drink');
INSERT INTO orders VALUES ('5', 'Cold Drink');
INSERT INTO orders VALUES ('6', 'Burger');
INSERT INTO orders VALUES ('6', 'Cold Drink');
INSERT INTO orders VALUES ('7', 'Pizza');
INSERT INTO orders VALUES ('8', 'Burger');

 * sqlite:///test.db
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [34]:
%%sql
SELECT user_id FROM orders WHERE item_ordered = "Burger"
INTERSECT
SELECT user_id FROM orders WHERE item_ordered= "Cold Drink"
EXCEPT
SELECT user_id FROM orders WHERE item_ordered NOT IN ("Burger", "Cold Drink") ;

 * sqlite:///test.db
Done.

[(2,), (3,), (6,)]

***Problem statement 7***: Part (a)

*   ğ–ğ«ğ¢ğ­ğ ğšğ§ ğ’ğğ‹ ğªğ®ğğ«ğ² ğ­ğ¨ ğŸğ¢ğ§ğ ğ­ğ¡ğ ğ®ğ¬ğğ«ğ¬ ğ°ğ¡ğ¨ ğğ±ğœğ¥ğ®ğ¬ğ¢ğ¯ğğ¥ğ² ğ©ğ®ğ«ğœğ¡ğšğ¬ğğ ğ¢ğğ¡ğ¨ğ§ğ ğŸğŸ“ ğ¨ğ§ğ¥ğ² ğšğ§ğ ğğ¢ğ ğ§ğ¨ğ­ ğ›ğ®ğ² ğšğ§ğ² ğ¨ğ­ğ¡ğğ« ğ¢ğğ¡ğ¨ğ§ğ ğ¦ğ¨ğğl

In [35]:
%%sql
CREATE TABLE iphone_dataset
(
user_id VARCHAR(20),
iphone_model VARCHAR(20)
);
INSERT INTO iphone_dataset (user_id, iphone_model) VALUES ('1', 'i-11');
INSERT INTO iphone_dataset (user_id, iphone_model) VALUES ('1', 'i-12');
INSERT INTO iphone_dataset (user_id, iphone_model) VALUES ('1', 'i-13');
INSERT INTO iphone_dataset (user_id, iphone_model) VALUES ('1', 'i-14');
INSERT INTO iphone_dataset (user_id, iphone_model) VALUES ('1', 'i-15');
INSERT INTO iphone_dataset (user_id, iphone_model) VALUES ('2', 'i-15');
INSERT INTO iphone_dataset (user_id, iphone_model) VALUES ('3', 'i-12');
INSERT INTO iphone_dataset (user_id, iphone_model) VALUES ('3', 'i-15');

CREATE TABLE iphone_products_dim
(
iphone_model VARCHAR(20)
);
INSERT INTO iphone_products_dim (iphone_model) VALUES ('i-11');
INSERT INTO iphone_products_dim (iphone_model) VALUES ('i-12');
INSERT INTO iphone_products_dim (iphone_model) VALUES ('i-13');
INSERT INTO iphone_products_dim (iphone_model) VALUES ('i-14');
INSERT INTO iphone_products_dim (iphone_model) VALUES ('i-15');

 * sqlite:///test.db
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [36]:
%%sql
select user_id from iphone_dataset where iphone_model = 'i-15'
and user_id not in(select user_id from iphone_dataset where iphone_model != 'i-15');

 * sqlite:///test.db
Done.

[('2',)]

***Problem statement 7***: Part (b)

*   ğ–ğ«ğ¢ğ­ğ ğšğ§ ğ’ğğ‹ ğªğ®ğğ«ğ² ğ­ğ¨ ğ¢ğğğ§ğ­ğ¢ğŸğ² ğ®ğ¬ğğ«ğ¬ ğ°ğ¡ğ¨ ğ¡ğšğ¯ğ ğ®ğ©ğ ğ«ğšğğğ ğ­ğ¡ğğ¢ğ« ğ¢ğğ¡ğ¨ğ§ğ ğ¦ğ¨ğğğ¥ ğŸğ«ğ¨ğ¦ ğ¢ğğ¡ğ¨ğ§ğ ğŸğŸ ğ­ğ¨ ğ¢ğğ¡ğ¨ğ§ğ ğŸğŸ“, ğšğ§ğ ğ­ğ¡ğğ² ğ¡ğšğ¯ğ ğ¨ğ§ğ¥ğ² ğ©ğ®ğ«ğœğ¡ğšğ¬ğğ ğ­ğ°ğ¨ ğ¢ğğ¡ğ¨ğ§ğ ğ¦ğ¨ğğğ¥ğ¬ ğ¢ğ§ ğ­ğ¨ğ­ğšğ¥.

In [37]:
%%sql
SELECT user_id FROM
    (SELECT user_id FROM iphone_dataset WHERE iphone_model = "i-12"
    INTERSECT
    SELECT user_id FROM iphone_dataset WHERE iphone_model = "i-15") a
WHERE user_id = (
    SELECT user_id FROM
        ( SELECT user_id, COUNT(*) as total_model FROM iphone_dataset GROUP BY user_id ) b
    WHERE total_model = 2 ) ;

 * sqlite:///test.db
Done.

[('3',)]

***Problem statement 7***: Part (c)

*  ğ‚ğ¨ğ§ğ¬ğ¢ğğğ« ğ²ğ¨ğ® ğšğ«ğ ğ¡ğšğ¯ğ¢ğ§ğ  ğ¢ğ©ğ¡ğ¨ğ§ğ_ğ©ğ«ğ¨ğğ®ğœğ­ğ¬_ğğ¢ğ¦ ğ­ğšğ›ğ¥ğ ğ°ğ¡ğ¢ğœğ¡ ğœğ¨ğ§ğ­ğšğ¢ğ§ğ¬ ğšğ¥ğ¥ ğ­ğ¡ğ ğšğ¯ğšğ¢ğ¥ğšğ›ğ¥ğ ğ¢ğ©ğ¡ğ¨ğ§ğ ğ¦ğ¨ğğğ¥ğ¬. ğ–ğ«ğ¢ğ­ğ ğšğ§ ğ’ğğ‹ ğªğ®ğğ«ğ² ğ­ğ¨ ğŸğ¢ğ§ğ ğ­ğ¡ğ ğ®ğ¬ğğ«ğ¬ ğ°ğ¡ğ¨ ğ¡ğšğ¯ğ ğ©ğ®ğ«ğœğ¡ğšğ¬ğğ ğğ¯ğğ«ğ² ğ¢ğğ¡ğ¨ğ§ğ ğ¦ğ¨ğğğ¥ ğ¥ğ¢ğ¬ğ­ğğ ğ¢ğ§ ğ­ğ¡ğ ğ¢ğ©ğ¡ğ¨ğ§ğ_ğ©ğ«ğ¨ğğ®ğœğ­ğ¬_ğğ¢ğ¦ ğ­ğšğ›ğ¥ğ.

In [38]:
%%sql
SELECT user_id FROM
    (SELECT user_id , COUNT(DISTINCT iphone_model) total FROM iphone_dataset GROUP BY user_id) a
WHERE total = (
    SELECT COUNT(*) total FROM iphone_products_dim )

 * sqlite:///test.db
Done.

[('1',)]

***Problem statement 8*** : Write an SQL query ğ­ğ¨ ğŸğ¢ğ§ğ ğ¨ğ®ğ­ ğ­ğ¡ğ ğœğ¨ğ®ğ§ğ­ ğ¨ğŸ ğğ¨ğ§ ğğ±ğœğ¥ğ®ğ¬ğ¢ğ¯ğ ğ©ğ«ğ¨ğğ®ğœğ­ğ¬ ğŸğ¨ğ« ğš ğ¯ğğ§ğğ¨ğ«.
ğğ¨ğ§ ğğ±ğœğ¥ğ®ğ¬ğ¢ğ¯ğ ğ©ğ«ğ¨ğğ®ğœğ­ğ¬: A product which is not available in any other vendors in the table.

In [40]:
%%sql
create table tbl (vendor varchar(10), product varchar(20));
insert into tbl values ('a','grape');
insert into tbl values ('a','peach');
insert into tbl values ('a','orange');
insert into tbl values ('b','peach');
insert into tbl values ('b','strawberry');
insert into tbl values ('b','apple');
insert into tbl values ('c','grape');
insert into tbl values ('c','peach');
insert into tbl values ('c','pineapple');

 * sqlite:///test.db
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [41]:
%%sql
WITH cte AS
( SELECT * FROM tbl WHERE product in
    ( SELECT product FROM tbl GROUP BY product HAVING COUNT(product) = 1 ) ) -- non exclusive condition
SELECT vendor, COUNT(product) non_exclusive_products_cnt FROM cte GROUP BY vendor ;

 * sqlite:///test.db
Done.

[('a', 1), ('b', 2), ('c', 1)]

**Problem statement 9**: Write an SQL query ğ­ğ¨ ğŸğ¢ğ§ğ ğ­ğ¡ğ ğ­ğ±ğ§ğ¦ğ¨ğ§ğ­ğ¡ ğ°ğ¡ğ¢ğœğ¡ ğ¡ğšğ¬ ğ­ğ¡ğ ğ¦ğšğ±ğ¢ğ¦ğ®ğ¦ ğ­ğ±ğ§ğšğ¦ğ¨ğ®ğ§ğ­.

In [42]:
%%sql
create table eshop(txnmonth varchar(50),clothing int,electronics int,sports int);
insert into eshop values('Jan',2000,1500,3000);
insert into eshop values('Feb',1000,2500,4000);
insert into eshop values('Mar',2000,1400,1000);
insert into eshop values('Apr',3000,1500,1000);

 * sqlite:///test.db
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [43]:
%%sql
with cte as (
    SELECT txnmonth, clothing+electronics+sports as txnamount FROM eshop )
SELECT txnmonth FROM cte WHERE txnamount = (SELECT MAX(txnamount) FROM cte) ;

 * sqlite:///test.db
Done.

[('Feb',)]

**Problem statement 10**: Write an SQL query ğ­ğ¨ ğŸğ¢ğ§ğ ğ­ğ¡ğ ğœğ¨ğ®ğ§ğ­ ğ¨ğŸ ğğ¢ğ¬ğ­ğ¢ğ§ğœğ­ ğğğ©ğšğ«ğ­ğ¦ğğ§ğ­ğ¬ excluding NULL

In [44]:
%%sql
create table department(deptid int, deptname varchar(50));
insert into department values(1,'Tech');
insert into department values(2,'HR');
insert into department values(3,null);
insert into department values(4,'Tech');
insert into department values(5,'HR');

 * sqlite:///test.db
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [45]:
%%sql
WITH cte as (SELECT DISTINCT deptname FROM department GROUP BY deptname)
SELECT count(*) no_of_dept FROM cte ;

 * sqlite:///test.db
Done.

[(3,)]

***Problem statement 11***: ğ˜ğ¨ğ® ğšğ«ğ ğ ğ¢ğ¯ğğ§ ğ­ğ¡ğ ğ©ğ«ğ¢ğœğ ğ¨ğŸ ğğšğœğ¡ ğ¬ğ¤ğ® ğ°ğ¡ğğ§ğğ¯ğğ« ğ­ğ¡ğğ«ğ ğ¢ğ¬ ğš ğœğ¡ğšğ§ğ ğ ğ¢ğ§ ğ©ğ«ğ¢ğœğ.
Write an SQL query ğ­ğ¨ ğŸğ¢ğ§ğ ğ­ğ¡ğ ğ©ğ«ğ¢ğœğ ğšğ­ ğ­ğ¡ğ ğ¬ğ­ğšğ«ğ­ ğ¨ğŸ ğğšğœğ¡ ğ¦ğ¨ğ§ğ­ğ¡ & ğœğšğ¥ğœğ®ğ¥ğšğ­ğ ğ­ğ¡ğ ğğ¢ğŸğŸğğ«ğğ§ğœğ ğŸğ«ğ¨ğ¦ ğ­ğ¡ğ ğ©ğ«ğğ¯ğ¢ğ¨ğ®ğ¬ ğ¦ğ¨ğ§ğ­ğ¡'ğ¬ ğ¬ğ­ğšğ«ğ­ ğğšğ­ğ.

In [46]:
%%sql
create table sku (sku_id int,
price_date date ,
price int
);
insert into sku values (1,'2023-01-01',10)
,(1,'2023-02-15',15)
,(1,'2023-03-03',18)
,(1,'2023-03-27',15)
,(1,'2023-04-06',20);

 * sqlite:///test.db
Done.
5 rows affected.

[]

In [54]:
%%sql
WITH cte AS (
    SELECT sku_id, price_date, price,ROW_NUMBER() OVER (PARTITION BY sku_id, strftime('%Y-%m', price_date)
    ORDER BY price_date DESC) AS new
    FROM sku
),
cte1 AS (SELECT sku_id, DATE(price_date, '+1 month', 'start of month') AS price_date, price
    FROM cte
    WHERE new = 1
UNION
    SELECT sku_id, price_date,price FROM sku WHERE strftime('%d', price_date) = '01'
    AND DATE(price_date, '+1 month', 'start of month') NOT IN (
        SELECT DATE(price_date, '+1 month', 'start of month')
        FROM sku
        WHERE strftime('%d', price_date) = '01'
    )
)
SELECT sku_id,price_date, price,
    IFNULL(price - LAG(price) OVER(PARTITION BY sku_id ORDER BY price_date), 0) AS price_diff
FROM cte1
ORDER BY sku_id, price_date;

 * sqlite:///test.db
Done.

[(1, '2023-02-01', 10, 0),
 (1, '2023-03-01', 15, 5),
 (1, '2023-04-01', 15, 0),
 (1, '2023-05-01', 20, 5)]

***Problem statement 12***: **Write an SQL query to find the total number of items that have been categorized as â€œExpensiveâ€.**

In [55]:
%%sql
CREATE TABLE product_price
(Id int, ItemId int, Price decimal(10, 2), PriceRating varchar(10)) ;
INSERT INTO product_price
(Id, ItemId, Price, PriceRating)
VALUES
(1, 100, 34.5, "EXPENSIVE") ,
(2, 145, 2.3, "CHEAP") ,
(3, 100, 34.5, "EXPENSIVE") ,
(4, 100, 34.5, "EXPENSIVE") ,
(5, 145, 10, "AFFORDABLE") ;

 * sqlite:///test.db
Done.
5 rows affected.

[]

In [56]:
%%sql
SELECT * FROM (
    (SELECT COUNT(*) AS itemscount FROM product_price ) a ,
    (SELECT COUNT(*) AS expensiveitemcount FROM product_price WHERE PriceRating = "EXPENSIVE") b
)

 * sqlite:///test.db
Done.

[(5, 3)]

***Problem statement 13***: There is a phone log table that has information about callers call history.
Write a sql to find out callers whose first and last call was to the same person on a given day.

In [57]:
%%sql
create table phonelog(
    Callerid int,
    Recipientid int,
    Datecalled datetime
);

insert into phonelog(Callerid, Recipientid, Datecalled)
values(1, 2, '2019-01-01 09:00:00.000'),
       (1, 3, '2019-01-01 17:00:00.000'),
       (1, 4, '2019-01-01 23:00:00.000'),
       (2, 5, '2019-07-05 09:00:00.000'),
       (2, 3, '2019-07-05 17:00:00.000'),
       (2, 3, '2019-07-05 17:20:00.000'),
       (2, 5, '2019-07-05 23:00:00.000'),
       (2, 3, '2019-08-01 09:00:00.000'),
       (2, 3, '2019-08-01 17:00:00.000'),
       (2, 5, '2019-08-01 19:30:00.000'),
       (2, 4, '2019-08-02 09:00:00.000'),
       (2, 5, '2019-08-02 10:00:00.000'),
       (2, 5, '2019-08-02 10:45:00.000'),
       (2, 4, '2019-08-02 11:00:00.000');

 * sqlite:///test.db
Done.
14 rows affected.

[]

In [62]:
%%sql
WITH cte1 AS (SELECT * FROM phonelog WHERE Datecalled IN (
        SELECT MIN(Datecalled) AS start FROM phonelog
        GROUP BY Callerid, strftime('%Y-%m', Datecalled), DATE(Datecalled)
    )
),
cte2 AS (SELECT * FROM phonelog WHERE Datecalled IN (SELECT MAX(Datecalled) AS end
        FROM phonelog
        GROUP BY Callerid, strftime('%Y-%m', Datecalled), DATE(Datecalled)
    )
)
SELECT cte1.Callerid,
DATE(cte1.Datecalled) AS called_date,
    cte1.Datecalled AS first_call,
    cte2.Datecalled AS last_call,
    cte2.Recipientid
FROM cte1
INNER JOIN cte2
ON cte1.Callerid = cte2.Callerid
AND DATE(cte1.Datecalled) = DATE(cte2.Datecalled)
AND cte1.Recipientid = cte2.Recipientid;

 * sqlite:///test.db
Done.

[(2, '2019-07-05', '2019-07-05 09:00:00.000', '2019-07-05 23:00:00.000', 5),
 (2, '2019-08-02', '2019-08-02 09:00:00.000', '2019-08-02 11:00:00.000', 4)]

**Problem statement 14** : **Find how many products falls into the customer budget along with list of products**.
- In case of a clash choose the less costly product

In [63]:
%%sql
create table products
(
product_id varchar(20) ,
cost int
);
insert into products values ('P1',200),('P2',300),('P3',500),('P4',800);

create table customer_budget
(
customer_id int,
budget int
);

insert into customer_budget values (100,400),(200,800),(300,1500);

 * sqlite:///test.db
Done.
4 rows affected.
Done.
3 rows affected.

[]

In [70]:
%%sql
WITH cte AS (SELECT product_id, cost,SUM(cost) OVER (ORDER BY cost ASC) AS total_cost
    FROM products
)
SELECT c.customer_id, c.budget, COUNT(p.product_id) AS product_count,
    GROUP_CONCAT(p.product_id, ',') AS product_list
FROM
    customer_budget c
LEFT JOIN
    cte p
ON
    c.budget >= p.total_cost
GROUP BY
    c.customer_id,
    c.budget
ORDER BY
    c.customer_id;

 * sqlite:///test.db
Done.

[(100, 400, 1, 'P1'), (200, 800, 2, 'P1,P2'), (300, 1500, 3, 'P1,P2,P3')]